In [1]:
import pymssql
import sqlalchemy
import pandas as pd
import requests

from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker, relationship
from sqlalchemy import MetaData
from sqlalchemy import create_engine
from sqlalchemy import Column, Integer, String, ForeignKey
from sqlalchemy import Sequence

import transaction

from sqlalchemy import ForeignKey
from sqlalchemy.orm import relationship

from sqlalchemy import Table, Text

In [2]:
# engine = create_engine("postgresql://postgres:abc@localhost:5432/rommel2")

engine = create_engine('sqlite:///:memory:')

In [4]:
Base = declarative_base()


class User(Base):
    __tablename__ = 'users'
    id = Column(Integer, Sequence('user_id_seq'), primary_key=True)
    name = Column(String(50))
    fullname = Column(String(50))
    nickname = Column(String(50))

    
class Address(Base):
    __tablename__ = 'addresses'
    id = Column(Integer, primary_key=True)
    email_address = Column(String, nullable=False)
    user_id = Column(Integer, ForeignKey('users.id'))
    user = relationship("User", back_populates="addresses")

User.addresses = relationship("Address", order_by=Address.id, back_populates="user")

post_keywords = Table('post_keywords', Base.metadata,
    Column('post_id', ForeignKey('posts.id'), primary_key=True),
    Column('keyword_id', ForeignKey('keywords.id'), primary_key=True))

class BlogPost(Base):
    __tablename__ = 'posts'
    id = Column(Integer, primary_key=True)
    user_id = Column(Integer, ForeignKey('users.id'))
    headline = Column(String(255), nullable=False)
    body = Column(Text)
    # many to many BlogPost<->Keyword
    keywords = relationship('Keyword',
                            secondary=post_keywords,
                            back_populates='posts')
    def __init__(self, headline, body, author):
        self.author = author
        self.headline = headline
        self.body = body
    def __repr__(self):
        return "BlogPost(%r, %r, %r)" % (self.headline, self.body, self.author)
    
    
class Keyword(Base):
    __tablename__ = 'keywords'
    id = Column(Integer, primary_key=True)
    keyword = Column(String(50), nullable=False, unique=True)
    posts = relationship('BlogPost',
                         secondary=post_keywords,
                         back_populates='keywords')
    def __init__(self, keyword):
        self.keyword = keyword
        
BlogPost.author = relationship(User, back_populates="posts")
User.posts = relationship(BlogPost, back_populates="author", lazy="dynamic")

    
Session = sessionmaker(bind=engine)
Base.metadata.create_all(bind=engine)

session = Session()
session.commit()
session.close()

In [5]:
ed_user = User(name='ed', fullname='Ed Jones', nickname='edsnickname')
session.add(ed_user)

In [6]:
our_user = session.query(User).filter_by(name='ed').first() 
ed_user is our_user

True

In [7]:
session.commit()

In [8]:
session = Session()

session.add_all([
    User(name='wendy', fullname='Wendy Williams', nickname='windy'),
    User(name='mary', fullname='Mary Contrary', nickname='mary'),
    User(name='fred', fullname='Fred Flintstone', nickname='freddy')])

session.commit()
session.close()

In [9]:
session = Session()

jack = User(name='jack', fullname='Jack Bean', nickname='gjffdd')

jack.addresses = [
                Address(email_address='jack@google.com'),
                Address(email_address='j25@yahoo.com')]

session.add(jack)
session.commit()

In [10]:
session = Session()
wendy = session.query(User).filter_by(name='wendy').one()
post = BlogPost("Wendy's Blog Post", "This is a test", wendy)
post.keywords.append(Keyword('wendy'))
post.keywords.append(Keyword('firstpost'))
session.commit()

In [11]:
session.query(BlogPost).filter(BlogPost.keywords.any(keyword='firstpost')).all()

[BlogPost("Wendy's Blog Post", 'This is a test', <__main__.User object at 0x000001B6FD38AFD0>)]

In [12]:
pd.read_sql_table('addresses', engine)

   id    email_address  user_id
0   1  jack@google.com        5
1   2    j25@yahoo.com        5

In [13]:
pd.read_sql_table('users', engine)

   id   name         fullname     nickname
0   1     ed         Ed Jones  edsnickname
1   2  wendy   Wendy Williams        windy
2   3   mary    Mary Contrary         mary
3   4   fred  Fred Flintstone       freddy
4   5   jack        Jack Bean       gjffdd

In [14]:
pd.read_sql_table('keywords', engine)

   id    keyword
0   1      wendy
1   2  firstpost

In [15]:
pd.read_sql_table('post_keywords', engine)

   post_id  keyword_id
0        1           2
1        1           1

In [16]:
pd.read_sql_table('posts', engine)

   id  user_id           headline            body
0   1        2  Wendy's Blog Post  This is a test